# Homebrew Bundle
# https://github.com/Homebrew/homebrew-bundle

# ------------------------------------------------------------------------------
# CLI Tools
# ------------------------------------------------------------------------------
brew "git"
brew "zsh"
brew "zsh-completions"
brew "node"
brew "coreutils"
brew "fnm"
brew "eza"
brew "zoxide"
brew "fzf"
brew "wget"
brew "tldr"
brew "gh"
brew "terminal-notifier"
brew "speedtest-cli"
brew "bat"
brew "trash-cli"
brew "httrack"
brew "direnv"
brew "pygments"
brew "colima"
brew "docker"
brew "docker-compose"
brew "poppler"

# Only required when adding App Store applications
#brew "mas"

# ------------------------------------------------------------------------------
# Cask
# ------------------------------------------------------------------------------

# VS Code Fonts
cask "font-fira-code"
cask "font-monaspace"
cask "font-ibm-plex-mono"

# Terminal Fonts
cask "font-fira-code-nerd-font"
cask "font-hasklug-nerd-font"
cask "font-monaspace-nerd-font"

# Utils
cask "transmit"
cask "keepingyouawake"
cask "integrity"
cask "maccy"
cask "teamviewer"
cask "appcleaner"
cask "dropbox"

# Media
cask "vlc"

# Development
cask "sequel-ace"
cask "iterm2"
cask "visual-studio-code"
cask "cursor"
cask "tableplus"

# Desktop applications
cask "telegram"
cask "google-chrome"
cask "firefox"
cask "brave-browser"
cask "discord"

# Office applications
cask "microsoft-powerpoint"
cask "microsoft-word"
cask "microsoft-excel"
cask "microsoft-teams"
cask "onedrive"
cask "microsoft-auto-update"

# Quick Look plugins
cask "qlcolorcode" # https://github.com/anthonygelibert/QLColorCode
cask "qlstephen" # https://github.com/whomwah/qlstephen
cask "quicklook-json" # https://github.com/sindresorhus/quick-look-plugins
cask "webpquicklook" # https://github.com/dchest/webp-quicklook

# ------------------------------------------------------------------------------
# App Store applications
# ------------------------------------------------------------------------------
#mas "Home Assistant", id: 1099568401
