# Homebrew Bundle
# https://github.com/Homebrew/homebrew-bundle

# ------------------------------------------------------------------------------
# CLI Tools
# ------------------------------------------------------------------------------
brew "git"
brew "zsh"
brew "zsh-completions"
brew "node"
brew "coreutils"
brew "fnm"
brew "eza"
brew "zoxide"
brew "fzf"
brew "wget"
brew "tldr"
brew "gh"
brew "terminal-notifier"
brew "speedtest-cli"
brew "bat"
brew "trash-cli"
brew "php"
brew "mysql"
brew "redis"
brew "composer"
# Only required when adding App Store applications
#brew "mas"

# ------------------------------------------------------------------------------
# Cask
# ------------------------------------------------------------------------------

# Fonts
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-hasklug-nerd-font"

# Utils
cask "transmit"
cask "keepingyouawake"
cask "copyclip"
cask "sitesucker-pro"
cask "integrity"

# Media
cask "vlc"

# Development
cask "sequel-ace"
cask "iterm2"
cask "visual-studio-code"

# Desktop applications
cask "telegram"
cask "google-chrome"
cask "firefox"
cask "brave-browser"
cask "discord"

# Office applications
cask "microsoft-powerpoint"
cask "microsoft-word"
cask "microsoft-excel"
cask "microsoft-teams"
cask "onedrive"

# Quick Look plugins
cask "qlcolorcode" # https://github.com/anthonygelibert/QLColorCode
cask "qlstephen" # https://github.com/whomwah/qlstephen
cask "quicklook-json" # https://github.com/sindresorhus/quick-look-plugins
cask "qlimagesize" # https://github.com/Nyx0uf/qlImageSize
cask "webpquicklook" # https://github.com/dchest/webp-quicklook

# ------------------------------------------------------------------------------
# App Store applications
# ------------------------------------------------------------------------------
#mas "Home Assistant", id: 1099568401
